a = [(166, 55.2), (157, 55.2), (170, 55.2), (175, 90), (166, 73), (180, 73)]
print(a)

b = sorted(a)
print(b)    
# [(157, 55.2), (166, 55.2), (166, 73), (170, 55.2), (175, 90), (180, 73)]

def weight(t):
    h = t[0]
    w = t[1]
    return w  # или return t[1]
    
b = sorted(a, key=weight)
print(b)
# [(166, 55.2), (157, 55.2), (170, 55.2), (166, 73), (180, 73), (175, 90)]

def weight_decr(t):
    h = t[0]
    w = t[1]
    return -w  # или return -t[1]
    
b = sorted(a, key=weight_decr)
print(b)
# [(175, 90), (166, 73), (180, 73), (166, 55.2), (157, 55.2), (170, 55.2)]

    
def wh1(t):
    h = t[0]
    w = t[1]
    return (w, h)  # обязательно возвратить tuple
    
b = sorted(a, key=wh1)
print(b)
# [(157, 55.2), (166, 55.2), (170, 55.2), (166, 73), (180, 73), (175, 90)]

def wh2(t):
    h = t[0]
    w = t[1]
    return (w, -h)  # обязательно возвратить tuple
    
b = sorted(a, key=wh2)
print(b)
# [(170, 55.2), (166, 55.2), (157, 55.2), (180, 73), (166, 73), (175, 90)]

b = sorted(a, key=lambda t: (t[1], -t[0]))
print(b)
# [(170, 55.2), (166, 55.2), (157, 55.2), (180, 73), (166, 73), (175, 90)]




